Revit 2026 API

# ParameterUtilsGetBuiltInParameterGroupTypeId Method

---

The parameter group identifier corresponding to the given built-in parameter identifier.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId GetBuiltInParameterGroupTypeId(
	ForgeTypeId parameterTypeId
)
```
```vb
Public Shared Function GetBuiltInParameterGroupTypeId (
	parameterTypeId As ForgeTypeId
) As ForgeTypeId
```
```cpp
public:
static ForgeTypeId^ GetBuiltInParameterGroupTypeId(
	ForgeTypeId^ parameterTypeId
)
```
```fsharp
static member GetBuiltInParameterGroupTypeId :
        parameterTypeId : ForgeTypeId -> ForgeTypeId
```

#### Parameters

parameterTypeId ForgeTypeId
     The identifier to check.

#### Return Value

ForgeTypeId The parameter group identifier.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A ForgeTypeId identifies a built-in parameter if it corresponds to a valid BuiltInParameter value.

#### Reference

ParameterUtils Class

Autodesk.Revit.DB Namespace